common/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `qs_user` WHERE (`id`=7) AND (`status`=10)

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `qs_user` WHERE (`username`='ratnalevi') AND (`status`=10)